# MepPipeUpperInvertElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepPipeUpperInvertElevation Property
ParameterTypeId Class See Also
---
"Upper End Invert Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepPipeUpperInvertElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepPipeUpperInvertElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepPipeUpperInvertElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace